In [3]:
import pandas as pd
import numpy as np

# Series

## 테이블 모양의 Data Frame은 행 인덱스와 행 이름으로 구성

In [4]:
data = pd.Series(np.linspace(0, 1, num=5))
data

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [8]:
data.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [7]:
type(data.values)

numpy.ndarray

In [9]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
data[2:4]

2    0.50
3    0.75
dtype: float64

In [ ]:
data[(data > 0.1) & (data < 0.6)]

index 대신 keys
values 대신 items
items: index, value 쌍으로 튜플
--> 숫자가 아닌 값으로도 인덱스를 대신 할 수 있는 유연성 (명시적 인덱스: 직접 값을 지정)

In [11]:
list(data.keys())

[0, 1, 2, 3, 4]

In [12]:
list(data.items())

[(0, 0.0), (1, 0.25), (2, 0.5), (3, 0.75), (4, 1.0)]

In [13]:
data.index = ["a", "b", "c", "d", "e"]
data

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [14]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [15]:
data.loc["a"]

0.0

In [16]:
data.loc["a":"c"]

a    0.00
b    0.25
c    0.50
dtype: float64

명시적 인덱스 loc
암묵적 인덱스 iloc

In [17]:
data.loc[data > 0.7]

d    0.75
e    1.00
dtype: float64

In [18]:
data.iloc[0]

0.0

In [44]:
np.random.seed(0)

df = pd.DataFrame(np.random.randint(10, size=(3, 4)), columns=['col1', 'col2', 'col3', 'col4'])
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

다양한 타입의 데이터를 저장 가능한 dataframe

In [20]:
df["col2"]

0    0
1    9
2    4
Name: col2, dtype: int64

In [21]:
df.col2

0    0
1    9
2    4
Name: col2, dtype: int64

In [38]:
df.loc[0, "col2":"col3"]

Series([], Name: 0, dtype: float64)

In [39]:
df.loc[0:2, "col2":"col3"]

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [22]:
df.loc[[0], "col2":"col3"]

   col2  col3
0     0     3

묵시적 인덱서 iloc

In [24]:
df.iloc[0, 1:3] #0, 1,2  -->series

col2    0
col3    3
Name: 0, dtype: int64

In [25]:
df.iloc[0:1, 1:3] #0, 1,2  --> dataframe

   col2  col3
0     0     3

In [26]:
df.iloc[[0], 1:3]

   col2  col3
0     0     3

In [43]:
df.iloc[0:3, 1:3]  #slicing

     1  2
0  2.0  3
1  5.0  6
2  8.0  9

In [45]:
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [46]:
df["total"] = df.sum(axis=1) #열 추가_합 추가
df

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

In [33]:
df = df.drop(columns=["col4", "total"], axis=1) #열 제거
df

   col1  col2  col3
0     5     0     3
1     7     9     3
2     2     4     7

In [47]:
df.drop(index=1, axis=0)  #행 제거

   col1  col2  col3  col4  total
0     5     0     3     3     11
2     2     4     7     6     19

NAN not a number--> null

In [49]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [np.nan, 8, 9],
                   [10, np.nan, 12]])
df

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   NaN  8.0   9
3  10.0  NaN  12

In [36]:
df.dropna(axis=0)  #nan이 있는 행 제거

     0    1  2
0  1.0  2.0  3
1  4.0  5.0  6

In [48]:
df.fillna(df.mean(axis=0))  #nan이 있는 값 채우기

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

객체의 조인
1. 연결할 방향 지정
left_on, right_on
2. 중복값 제거 방향

In [30]:
df1 = pd.DataFrame({'name': ['이순신', '강감찬', '을지문덕', '김유신'],
                    'dept': ['연구개발', '영업', '연구개발', '인사']})
df2 = pd.DataFrame({'emp_name': ['강감찬', '을지문덕', '이순신', '이순신'],
                    'project': ["S", "D", "A", "S"]})

In [31]:
#내부 조인
pd.merge(df1, df2, left_on="name", right_on="emp_name").drop("emp_name", axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D

In [51]:
#외부 조인
pd.merge(df1, df2,how="outer", left_on="name", right_on="emp_name").drop("emp_name", axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D
4   김유신    인사     NaN

In [ ]:
seaborn 시각화패키지

In [52]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [53]:
#value를 이용한 정렬
#운임별 des 성별 asc
titanic.sort_values(by=["fare", "sex"], ascending=[False, True]).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False

datafame 객체의 그룹 연산

In [54]:
#성별 생존률 연산 aggregate
# 배열기호 이용해 dataframe 으로 고정
titanic.groupby("sex")[["survived"]].aggregate("mean")

        survived
sex
female  0.742038
male    0.188908

In [55]:
# 평균을 중심 이동해서 결과 표준화 
titanic.groupby("sex")[["survived"]].aggregate("mean").apply(lambda x: x - x.mean())

        survived
sex
female  0.276565
male   -0.276565

In [56]:
#unstack 함수를 이용해 series-->dataframe
titanic.groupby(["sex", "class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [57]:
#피벗 테이블 활용해 분석하기 
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447